[
  {
    "title": "Stop using Swagger-UI and MSW, but SDK instead",
    "description": "If you're a frontend developer, and have received swagger documents from backend, you may open it on swagger-ui. Reading a swagger documents from swagger-ui, you may implement interaction code with backend server using axios or fetch function. You also need to write DTO (Data Transfer Object) structures looking at JSON schema definitions. Some professional frontend developers even build a mocking backend server through msw for testing. During above processes, you may take a mistake that mis-reading API specs, or mis-writing DTO structures. Also, mocking the backend server with msw, you can misunderstand the real backend server's API specs. As long as front-end developers are human, not robots, these are all common mistakes we see all around us. By the way, such common mistakes sometimes cause serious problems in the real world. At least, such mistakes never be caught by compiler, but only by runtime. The more mistakes we make, the harder it is to catch and debug. Of course, even if there are no mistakes, redundant DTO or fetch function implementation and msw mocking code by hand is very laborious and cumbersome works.",
    "tags": [{
      "_id": "64ca18cec83c3d0b854ae828",
      "tag": "react.js",
      "colorCode": "#00D9FE"
    },
    {
      "_id": "64ca18cec83c3d0b854ae829",
      "tag": "angular.js",
      "colorCode": "#E03537"
    },
    {
      "_id": "64ca18cec83c3d0b854ae82a",
      "tag": "vue.js",
      "colorCode": "#47BA87"
    },
    {
      "_id": "64ca18cec83c3d0b854ae82b",
      "tag": "express.js",
      "colorCode": "#868686"
    }],
    "likes": 4,
    "comments": [
      {
        "uid": "",
        "comment": "this is helpful"
      }
    ],
    "postTime": "2023-08-02T03:16:59.251Z"
  }
]


[
  {
    "tag": "react.js",
    "colorCode": "#00D9FE"
  },
  {
    "tag": "angular.js",
    "colorCode": "#E03537"
  },
  {
    "tag": "vue.js",
    "colorCode": "#47BA87"
  },
  {
    
    "tag": "express.js",
    "colorCode": "#868686"
  },
  {
    "tag": "node.js",
    "colorCode": "#87CF30"
  },
  {
    "tag": "mongoos",
    "colorCode": "#8C0808"
  }
]